testTesults/stage_5/3_get_full_wrk.txt
Running 20s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 2.294ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.361ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 2.338ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.315ms, rate sampling interval: 11ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.18ms    4.00ms  27.10ms   85.77%
    Req/Sec    27.30     42.79   111.00     73.38%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.38ms
 75.000%    3.21ms
 90.000%    9.41ms
 99.000%   18.56ms
 99.900%   23.01ms
 99.990%   27.12ms
 99.999%   27.12ms
100.000%   27.12ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.333     0.000000            1         1.00
       0.741     0.100000          100         1.11
       0.908     0.200000          200         1.25
       1.082     0.300000          301         1.43
       1.217     0.400000          400         1.67
       1.384     0.500000          500         2.00
       1.488     0.550000          549         2.22
       1.627     0.600000          599         2.50
       1.874     0.650000          649         2.86
       2.421     0.700000          699         3.33
       3.207     0.750000          749         4.00
       3.909     0.775000          774         4.44
       4.839     0.800000          799         5.00
       5.735     0.825000          824         5.71
       6.875     0.850000          849         6.67
       7.923     0.875000          874         8.00
       8.415     0.887500          886         8.89
       9.519     0.900000          899        10.00
      10.015     0.912500          911        11.43
      10.607     0.925000          924        13.33
      11.879     0.937500          937        16.00
      12.087     0.943750          942        17.78
      12.575     0.950000          949        20.00
      12.735     0.956250          955        22.86
      12.951     0.962500          961        26.67
      13.479     0.968750          967        32.00
      13.799     0.971875          971        35.56
      14.263     0.975000          974        40.00
      15.071     0.978125          977        45.71
      16.375     0.981250          980        53.33
      17.183     0.984375          983        64.00
      17.887     0.985938          984        71.11
      17.983     0.987500          986        80.00
      18.559     0.989062          988        91.43
      19.103     0.990625          989       106.67
      19.663     0.992188          991       128.00
      19.663     0.992969          991       142.22
      19.759     0.993750          992       160.00
      20.383     0.994531          993       182.86
      20.703     0.995313          994       213.33
      21.711     0.996094          995       256.00
      21.711     0.996484          995       284.44
      21.711     0.996875          995       320.00
      22.079     0.997266          996       365.71
      22.079     0.997656          996       426.67
      23.007     0.998047          997       512.00
      23.007     0.998242          997       568.89
      23.007     0.998437          997       640.00
      23.007     0.998633          997       731.43
      23.007     0.998828          997       853.33
      27.119     0.999023          998      1024.00
      27.119     1.000000          998          inf
#[Mean    =        3.183, StdDeviation   =        4.004]
#[Max     =       27.104, Total count    =          998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2004 requests in 20.00s, 246.16KB read
Requests/sec:    100.18
Transfer/sec:     12.31KB
Running 20s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 2.027ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.786ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.799ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.922ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.25ms    2.94ms  17.68ms   89.96%
    Req/Sec    27.04     45.40   111.00     74.53%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.28ms
 75.000%    1.63ms
 90.000%    5.18ms
 99.000%   15.25ms
 99.900%   16.90ms
 99.990%   17.69ms
 99.999%   17.69ms
100.000%   17.69ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.258     0.000000            1         1.00
       0.785     0.100000          100         1.11
       0.928     0.200000          200         1.25
       1.060     0.300000          299         1.43
       1.154     0.400000          399         1.67
       1.285     0.500000          498         2.00
       1.344     0.550000          548         2.22
       1.400     0.600000          598         2.50
       1.471     0.650000          648         2.86
       1.542     0.700000          698         3.33
       1.633     0.750000          748         4.00
       1.710     0.775000          772         4.44
       1.844     0.800000          797         5.00
       2.195     0.825000          822         5.71
       2.647     0.850000          847         6.67
       3.743     0.875000          872         8.00
       4.251     0.887500          884         8.89
       5.291     0.900000          897        10.00
       6.363     0.912500          909        11.43
       7.467     0.925000          922        13.33
       7.835     0.937500          934        16.00
       8.159     0.943750          940        17.78
       8.535     0.950000          947        20.00
       9.975     0.956250          953        22.86
      11.607     0.962500          959        26.67
      12.367     0.968750          965        32.00
      12.999     0.971875          968        35.56
      13.351     0.975000          972        40.00
      13.847     0.978125          975        45.71
      14.407     0.981250          978        53.33
      14.815     0.984375          981        64.00
      14.831     0.985938          982        71.11
      14.999     0.987500          984        80.00
      15.247     0.989062          986        91.43
      15.287     0.990625          987       106.67
      15.439     0.992188          989       128.00
      15.439     0.992969          989       142.22
      15.695     0.993750          990       160.00
      15.791     0.994531          991       182.86
      15.823     0.995313          992       213.33
      16.543     0.996094          993       256.00
      16.543     0.996484          993       284.44
      16.543     0.996875          993       320.00
      16.767     0.997266          994       365.71
      16.767     0.997656          994       426.67
      16.895     0.998047          995       512.00
      16.895     0.998242          995       568.89
      16.895     0.998437          995       640.00
      16.895     0.998633          995       731.43
      16.895     0.998828          995       853.33
      17.695     0.999023          996      1024.00
      17.695     1.000000          996          inf
#[Mean    =        2.246, StdDeviation   =        2.943]
#[Max     =       17.680, Total count    =          996]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2004 requests in 20.00s, 246.16KB read
Requests/sec:    100.19
Transfer/sec:     12.31KB
Running 20s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 2.218ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.170ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.112ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.100ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.44ms    3.08ms  17.28ms   87.95%
    Req/Sec    27.02     45.32   111.00     74.99%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.30ms
 75.000%    1.71ms
 90.000%    6.97ms
 99.000%   16.01ms
 99.900%   17.01ms
 99.990%   17.30ms
 99.999%   17.30ms
100.000%   17.30ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.405     0.000000            1         1.00
       0.832     0.100000          100         1.11
       0.968     0.200000          200         1.25
       1.084     0.300000          299         1.43
       1.182     0.400000          399         1.67
       1.302     0.500000          498         2.00
       1.382     0.550000          548         2.22
       1.451     0.600000          598         2.50
       1.522     0.650000          649         2.86
       1.589     0.700000          698         3.33
       1.707     0.750000          748         4.00
       1.797     0.775000          772         4.44
       1.939     0.800000          797         5.00
       2.813     0.825000          822         5.71
       4.007     0.850000          847         6.67
       5.255     0.875000          872         8.00
       5.919     0.887500          884         8.89
       7.031     0.900000          897        10.00
       7.455     0.912500          909        11.43
       8.215     0.925000          922        13.33
       8.959     0.937500          934        16.00
       9.303     0.943750          941        17.78
       9.551     0.950000          947        20.00
       9.927     0.956250          953        22.86
      10.615     0.962500          960        26.67
      12.111     0.968750          965        32.00
      12.919     0.971875          968        35.56
      13.351     0.975000          972        40.00
      13.615     0.978125          975        45.71
      13.967     0.981250          978        53.33
      14.199     0.984375          981        64.00
      15.175     0.985938          982        71.11
      15.639     0.987500          984        80.00
      16.015     0.989062          986        91.43
      16.151     0.990625          987       106.67
      16.231     0.992188          989       128.00
      16.231     0.992969          989       142.22
      16.319     0.993750          991       160.00
      16.319     0.994531          991       182.86
      16.367     0.995313          992       213.33
      16.623     0.996094          993       256.00
      16.623     0.996484          993       284.44
      16.623     0.996875          993       320.00
      16.863     0.997266          994       365.71
      16.863     0.997656          994       426.67
      17.007     0.998047          995       512.00
      17.007     0.998242          995       568.89
      17.007     0.998437          995       640.00
      17.007     0.998633          995       731.43
      17.007     0.998828          995       853.33
      17.295     0.999023          996      1024.00
      17.295     1.000000          996          inf
#[Mean    =        2.442, StdDeviation   =        3.082]
#[Max     =       17.280, Total count    =          996]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2004 requests in 20.01s, 246.16KB read
Requests/sec:    100.16
Transfer/sec:     12.30KB